[
    {
      "materie": "Analiză Matematică",
      "credite": "5",
      "curs": "Olteanu Mircea",
      "seminar": "Negrescu Alexandru",
      "descriere": "Materia se leaga de analiza din liceu. Domnul Olteanu are un curs misto la care cel putin prima ora te tine in priza cu povesti de genu: De unde a venit nevoia de asa ceva. Face glume, interactioneaza cu studentii si cel putin eu am inteles cat de cat materia predata la curs. Primul curs despre infinit si cel de dupa partial despre fractali au fost cele mai interesante cursuri. Overall va recomand sa mergeti la cateva cursuri de ale lui pentru a vedea daca va place si voua (nu face prezenta la curs). La seminar, Negrescu explica pe intelesul tuturor si face exercitii tip care se dau si la examen. Atmosfera este destul de deschisa, uneori poate prea deschisa, mai face uneori niste glume deplasate (mi-a facut si mie una de toti banii), dar seminarist bun ca el mai rar. La partial (50 puncte) noua ne-a dat usor si se putea copia lejer, iar la examen (50 puncte) da aceleasi subiecte de ani de zile. La fel puteti si aici sa copiati lejer sau sa le invatati pe de rost. In plus mai primiti si 10 puncte extra pentru seminar."
    },
    {
      "materie": "Algebră Liniară, Geometrie Analitică și Ecuații Diferențiale",
      "credite": "5",
      "curs": "Niță Alina",
      "seminar": "Rodica / Ilișeanu",
      "descriere": "La primul curs m-a speriat pentru ca se astepta ca noi sa stim o groaza de chestii care nu s-au facut din cauza pandemiei. Doamna Nita stie materia, dar la capitolul predat am simtit ca am fost degeaba la cursuri. Scrie mult si explica putin. Ea va raspunde la intrebari dar, nu stiu cat tupeu o sa aveti sa o intrerupeti din 5 in 5 minute ca nu intelegeti ce naiba scrie la tabla. A intarziat de multe ori si pierde destul de mult timp vorbind despre fiul ei sau la telefon. Uneori era comic, dar dupa cateva dati devenea enervant.(uneori mai face prezenta la curs) La seminar doamna Iliseanu expune pe scurt ce s-a predat la curs si se fac probleme. La noi nu voia nimeni sa iasa asa ca scotea ea la tabla dupa catalog. De obicei se ia punctaj maxim la laborator. La partial invatati bine (si pt ca examenul e mai greu si pentru ca o sa va loviti de chestiile predate dupa partial), iar la examen bafta cu tocitul algoritmilor de rezolvare."
    },
    {
      "materie": "Programarea Calculatoarelor și Limbaje de Programare 1",
      "credite": "5",
      "curs": "Saru Daniela",
      "seminar": "Mocanu Ștefan / Baicu Diana",
      "descriere": "Eu unul am fost foarte multumit de cursul doamnei Saru. Chiar daca stiam 80% din ce a predat am fost la toate cursurile si mi-am aprofundat bazele. Explica foarte bine. Din toti profesorii mi s-a parut cea mai deschisa si dornica sa iti explice ce nu ai inteles sau chiar orice curiozitati despre facultate in general. Faceti C si o sa va duca prin toate chestiile posibile. Cum ne-a zis si mentorul nostru de an: From zero to hero. (nu face prezenta la curs). La laborator am facut cu Mocanu. Laboratorul cica ar trebui facut de acasa in mare parte si la laborator sa pui intrebari (am facut asa la inceput dar pe la sfarsit era destul de greu sa faci atatea probleme acasa asa ca faceam cateva de acasa sa vad ce si cum si restul la lab). Va pune note pe activitate la lab (intrebari, interactiuni, mai vine in spatele tau si vede daca scrii bine etc.). Nu o sa aflati decat la sfarsit nota pe laborator. Noi am dat si 2 teste intermediare, usoare, iar examenul s-a dat pe calculator unde profesoara a fost draguta si ne-a explicat in mare ce voia enuntul problemei (fenomenul) iar noi am avut doar de implementat chestia respectiva. Daca va miscati greu, scrieti acolo cat puteti ca oricum profa nu compileaza, o intereseaza sa vada ca stiti sa ganditi algoritmii. Daca va mai si merge cu atat mai bine, va verificati voi ca ce ati facut merge."
    },
    {
      "materie": "Introducere în Sisteme de Operare",
      "credite": "4",
      "curs": "Ana",
      "seminar": "Ioana si Ilinca",
      "descriere": "Mie chiar mi s-a parut o materie potrivita asta si in acelasi timp o gura de aer de la atata matematica si fizica. Inveti despre calculatoare, de la conceperea lui si pana la sisteme de operare. Eu va recomand sa ii dati o sansa domnului Mocanu. O sa auziti ca la el se pica in masa sau ca e Bau Bau. Pentru unii o sa fie adevarat, dar pentru altii nu. Adevarul e ca nu poti sa inveti toata materia in sesiune la materia asta. Dar daca inveti pe parcurs si intelegeti ce scrie acolo o sa fie ok. Fiti atenti la curs (da la examen din chestii pe care le zice dar nu le scrie in curs), luati si notite daca vi se pare util (eu nu am scris nimic la el la curs, eram doar atent) si fiti activi. A contat mult ca am fost activ. A facut un quiz la un moment dat la care am participat (daca raspundeai corect primeai 5 puncte, daca raspundeai gresit pierdeai 3 puncte), am mai raspuns la intrebari si am si pus cateva intrebari si chestia asta chiar a contat la examen, m-a tinut minte si mi-a dat 10. Asa ca incercati sa nu lasati tot pe ultima suta de metri si sa fiti activi. (nu face prezenta). La laborator faceti linux cu Craciunescu. Explica bine si e simpatic. La colocviu dati din linux si niste teorie, iar la examen doar teorie de la curs. Nu va recomand sa copiati, atat am de zis."
    },
    {
      "materie": "Mecanică",
      "credite": "4",
      "curs": "Craifaleanu Andrei",
      "seminar": "Costache / Ovanisof",
      "descriere": "Cursul mi s-a parut inutil, domnul Craifaleanu preda foarte repede si nu poti sa faci fata. (nu face prezenta la curs). Oricum toate exercitiile de se dau la test se fac la lab. Laboratorul m-a speriat la inceput (poate si pentru ca nu stiam mecanica mai deloc), dar usor usor am prins firul. Uneori o sa mai si programati :D niste chestii legate de mecanica. O sa aveti de facut teme care o sa va manance o groaza de timp daca vreti sa le faceti singuri sau sa le intelegeti in timp ce le  copiati de pe drive. Eu zic ca ajuta enorm sa le intelegeti ca fix asta da la partial / examen. Partialul a fost open book, iar la examen stiam dinainte o parte din subiecte. A facut si o pregatire online inainte de examen unde a mai facut exercitii tip de examen."
    },
    {
      "materie": "Psihologia Educației (Modulul Psihopedagogic, Opțional)",
      "credite": "5 extra",
      "curs": "-",
      "seminar": "-",
      "descriere": "A fost o materie ok, lejera la care nu am avut probleme. Nu era prezenta obligatorie, iar la seminar chiar mi-a placut ce am lucrat si discutat pe acolo."
    }
]