[
    {
      "materie": "Filosofie",
      "credite": "2",
      "curs": "-",
      "seminar": "-",
      "descriere": "-"
    },
    {
      "materie": "Logică",
      "credite": "2",
      "curs": "-",
      "seminar": "-",
      "descriere": "-"
    },
    {
      "materie": "Cultură și Civilizație",
      "credite": "2",
      "curs": "-",
      "seminar": "-",
      "descriere": "Invatati istorie dar despre iluminism si curente dastea. Destul de chill, la curs nu m-am dus decat o data. Prezenta la seminar nu prea e importanta, puteti chiuli de cateva ori lejer. O sa aveti de facut un ppt, il copiati de pe net."
    },
    {
      "materie": "Doctrine Politice",
      "credite": "2",
      "curs": "-",
      "seminar": "-",
      "descriere": "Măi, eu am luat optionalul ăsta fără să am habar ce se întâmplă pe aici, dar a fost mai mult decât ok. La curs o sa faceți cu domnul Mircea Toboșaru, un profesor super de treabă și foarte mișto, iar la seminar cu un baiat așa pe la 38-40 de ani, Adelin și nu mai stiu cum :))). La curs cel mai important este să te duci la primul, penultimul si ultimul curs.( primul ca să te aibă proful în vedere, la penultimul de obiciei o sa fie o activitate care valoreaza 20p, dar e super fun si cam trebuie doar să te duci și să îți dai puțin silința, iar la ultimul cologviul- aici o să aveți de explicat două texte succint postate de domnul profesor pe Moodle). La restul nu am fost :)))), dar nu a ținut cont de prezențe, dar cel mai bine, o să vă spună el la primul curs totul mai pe larg. La seminar poți să faci maxim 60 de p. din nota totală doar. Ca să faci punctele, cel mai important e să faci 4/6 prezențe minim, să răspundeți cât vă pricepeți, ca el mai mult punctează pe încercare, nu pe calitate,(plus că oricum lucrurile de la această materie sunt foartr subiective imo), și o să mai dea el niște activități pe parcurs, pe care dacă le faci, aduni punctele. Dar în mare parte, da, la seminarii cam trebuie să mergeți dacă vreți 10, la cursuri așa și așa zic eu, dar per total, dacă știi că îți place să vorbești despre politică și vrei un opțional mai chill, recomand."
    },
    {
      "materie": "Istoria și Filosofia Culturii",
      "credite": "2",
      "curs": "-",
      "seminar": "-",
      "descriere": "-"
    }
]